# EA_DataAccGetInt

## Description
Returns integer value from the object, associated to the accessory index.

```pascal
FUNCTION EA_DataAccGetInt(
				acc        : INTEGER;
				valueIndex : INTEGER) : INTEGER;
```

```python

def vs.EA_DataAccGetInt(acc, valueIndex):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|acc|INTEGER||
|valueIndex|INTEGER||

## Version
Availability: from Vectorworks 2016
## Category
* EnergyAnalysis Interface Library